Tekla.Structures.Model.RebarComplexGeometry
The ReinforcingBar class represents a single physical reinforcing bar. It contains the curves
and bendings that define the geometry of the bar.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
public void Example1()
{
var rebarGroup = new RebarGroup();
var barGeometries = rebarGroup.GetRebarComplexGeometries(true, true, true);
foreach (RebarComplexGeometry barGeom in barGeometries)
{
Console.WriteLine("Bar has the following curves:");
foreach (var leg in barGeom.Legs)
{
if (leg.Curve is LineSegment)
{
Console.Write("Line ");
}
else if (leg.Curve is Arc)
{
Console.Write("Arc ");
}
}
Console.WriteLine();
}
}
}

Tekla.Structures.Model.RebarComplexGeometry.#ctor
The constructor for RebarGeometry. The class requires index which
indicates the position in the rebar group. Index starts with 1.

Tekla.Structures.Model.RebarComplexGeometry.#ctor(System.Collections.Generic.List{Tekla.Structures.Model.RebarLeg},System.Collections.Generic.List{System.Double},System.Double)
Creates a new RebarGeometry using the given legs, bending radius and diameter.
legs: The list of rebar legs.
bendingRadiuses: The list of bending radius.
diameter: The diameter.

Tekla.Structures.Model.RebarComplexGeometry.Legs
Gets the list of Tekla.Structures.Model.RebarLegs of the bar.

Tekla.Structures.Model.RebarComplexGeometry.Diameter
Gets the diameter of the wire.

Tekla.Structures.Model.RebarComplexGeometry.BendingRadiuses
The bending radiuses of the wire.

Tekla.Structures.Model.RebarComplexGeometry.FromData(System.Double[],System.Int32[],System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotPolycurvePoint_t},System.Int32@)


Tekla.Structures.Model.RebarComplexGeometry.ToString


Tekla.Structures.Model.RebarComplexGeometry.GetHashCode


Tekla.Structures.Model.RebarComplexGeometry.Equals(System.Object)
